### [DataFrame 연산 - 3]
- 일대일대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산수행 메서드 활용
- nan에 대한 값 설정으로 연산 수행 가능

In [1]:
# [1] 모듈 로딩
import pandas as pd
import numpy as np # 빈칸을 의미하는 표현법 사용을 위해 호출

In [2]:
# [2] 데이터 준비
data = {"A" : [98, 78, np.nan, 52],
        "B" : [83, 78, 73, 62]}

In [3]:
# [3] Dict 데이터를 == 데이터 프레임 형태로 저장
DF1 = pd.DataFrame(data)
DF1

      A   B
0  98.0  83
1  78.0  78
2   NaN  73
3  52.0  62

In [5]:
# [4] 연산수행 
# DataFrame + 숫자
DF1.add(5, fill_value=0)

       A   B
0  103.0  88
1   83.0  83
2    5.0  78
3   57.0  67

In [9]:
# DataFrame + DataFrame  ==> 데이터 프레임에서 양쪽이 nan이면 그냥 nan을 줌 
DF1.add(DF1+10, fill_value=-10)

       A    B
0  206.0  176
1  166.0  166
2    NaN  156
3  114.0  134

In [14]:
# [2] 데이터 준비
data2 = {"A" : [98, 78, 20, 52],
        "B" : [83, 78, 73, 62]}
DF2 = pd.DataFrame(data2)
DF2

    A   B
0  98  83
1  78  78
2  20  73
3  52  62

In [15]:
DF1.add(DF2, fill_value = 0)

       A    B
0  196.0  166
1  156.0  156
2   20.0  146
3  104.0  124